app/views/users/show.html.erb

              <td><%= render 'favorites/btn', book: book %></td>
              <td>コメント件数:<%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 2]]