app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
                <td><%= render 'favorites/btn', book: book %></td>
                <td>コメント件数:<%= book.book_comments.count %></td>