app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "daichi_book"], ["body", "面白い"], ["user_id", 2], ["created_at", "2023-08-15 11:20:27.117708"], ["updated_at", "2023-08-15 11:20:27.117708"]]
SELECT "books".* FROM "books"
---
  def create
    @book_new = Book.new(book_params)
    @book_new.user_id = current_user.id
    if @book_new.save
     flash[:notice] = "You have created book successfully."
     redirect_to book_path(@book_new.id)
    else
      @books = Book.all

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
    @book_new = Book.new
    @book = Book.find(params[:id])
    @user = User.find(@book.user_id)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "user_id" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "aaaa"], ["body", "aaaa"], ["user_id", 4], ["updated_at", "2023-08-18 09:20:41.066264"], ["id", 6]]
---
  def update
    @book = Book.find(params[:id])
    @book.user_id = current_user.id
    if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def correct_user
    @book = Book.find(params[:id])