app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ?, "introduction" = ? WHERE "users"."id" = ?  [["name", "DD"], ["updated_at", "2023-08-18 08:51:31.071896"], ["introduction", "DDです"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)